КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bb33b3e3-7a69-47fd-93df-2ef5d81b4ced">
      <name>ЭтоУпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="323f8573-378e-4fef-931a-b93c2c113890">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="628b3ce2-4791-489a-9690-8cc51d7f27c4">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Catalogs/ВариантыКомплектацииНоменклатуры/ВариантыКомплектацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ce49200-30ea-44d6-97f7-390bc2c5dee9">
  <name>ВариантыКомплектацииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Номенклатура</owners>
  <tabularSections extendedConfigurationObject="354a86ec-cf4f-4299-a60e-80a77f619e67">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6219b3de-db0c-4d3e-b4f2-58419c6950a0">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5f89eb00-a169-4f6d-b578-df09d9d8a64e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f089d29-db58-4577-966e-b19048e606cd">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/РасходныйОрдерНаТовары/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаКлиенте
Процедура ОД_ПослеЗаписиПосле(ПараметрыЗаписи)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

#Область НаборыКомплекты

Процедура ЗаполнитьНаборыКомплекты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ_Товары.Номенклатура КАК Номенклатура,
		|	ТЗ_Товары.НоменклатураНабора КАК НоменклатураНабора,
		|	ТЗ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТЗ_Товары.СуммаСНДС КАК СуммаСНДС
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СУММА(ВТ_Товары.КоличествоУпаковок) КАК Количество,
		|	СУММА(ВТ_Товары.СуммаСНДС) КАК Сумма,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Набор,
		|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_Наборы
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВТ_Товары.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	ВариантыКомплектацииНоменклатуры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок) КАК КоличествоВНаборе,
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_ВариантыКомплектации
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Наборы.Набор КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Сумма / (ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе)
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	ВТ_Наборы КАК ВТ_Наборы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВариантыКомплектации КАК ВТ_ВариантыКомплектации
		|		ПО ВТ_Наборы.ВариантКомплектации = ВТ_ВариантыКомплектации.ВариантКомплектации";
	
	
	
	ТЗ_Товары = Новый ТаблицаЗначений;
	ТЗ_Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ_Товары.Колонки.Добавить("НоменклатураНабора", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ_Товары.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
	ТЗ_Товары.Колонки.Добавить("СуммаСНДС", Новый ОписаниеТипов("Число"));
	
	ТЗ_Распоряжения = Объект.ТоварыПоРаспоряжениям.Выгрузить();
	ТЗ_Распоряжения.Свернуть("Распоряжение");
	
	Для каждого СтрокаТЗ Из ТЗ_Распоряжения Цикл 
		Для каждого Т Из СтрокаТЗ.Распоряжение.Товары Цикл
			// не берем товары, если они есть в заказе, но нет в ордере
            НайденыСтроки = Объект.ОтгружаемыеТовары.НайтиСтроки(Новый Структура("Номенклатура", Т.Номенклатура));
			Если НайденыСтроки.Количество() > 0 Тогда
				НоваяСтрока = ТЗ_Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	

	Запрос.УстановитьПараметр("ТЗ_Товары", ТЗ_Товары);
	
	РезультатЗапроса = Запрос.Выполнить();

	Наборы.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Наборы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	НаборыКомплектыКоличество = Наборы.Количество();

КонецПроцедуры

#КонецОбласти
